### 데이터 쓰기&불러오기

In [3]:
with open('ids.txt', 'w') as f :
    f.write('ID\nJohn\nKarl\nAndy\nTim\n')
    
with open('data1.txt', 'w') as f :
    f.write('ID\tfield1\tfield2\tfield3\nTom\t1\t3\t1\nJohn\t1\t3\t3\nTom\t1\t1\t1\nKarl\t1\t1\t2\nKarl\t1\t3\t2\nKarl\t2\t2\t2\nAndy\t1\t2\t3')

with open('data2.txt', 'w') as f :
    f.write('ID\tfield1\tfield2\tfield3\nTom\t2\t3\t1\nJane\t1\t1\t3\nJane\t2\t2\t1\nMax\t3\t1\t2\nKarl\t1\t4\t2\nMax\t3\t2\t2\nMax\t2\t2\t1')

In [4]:
import pandas as pd

ids = pd.read_csv('./ids.txt', delimiter = "\t")
data1 = pd.read_csv('./data1.txt', delimiter = "\t")
data2 = pd.read_csv('./data2.txt', delimiter = "\t")

### 데이터 확인

In [6]:
data1

     ID  field1  field2  field3
0   Tom       1       3       1
1  John       1       3       3
2   Tom       1       1       1
3  Karl       1       1       2
4  Karl       1       3       2
5  Karl       2       2       2
6  Andy       1       2       3

In [7]:
data2

     ID  field1  field2  field3
0   Tom       2       3       1
1  Jane       1       1       3
2  Jane       2       2       1
3   Max       3       1       2
4  Karl       1       4       2
5   Max       3       2       2
6   Max       2       2       1

In [9]:
ids

     ID
0  John
1  Karl
2  Andy
3   Tim

### 필터 만들기

In [11]:
idlist = list(ids['ID'])
idlist

['John', 'Karl', 'Andy', 'Tim']

In [13]:
filter_d1 = data1['ID'].isin(idlist)
filter_d1

0    False
1     True
2    False
3     True
4     True
5     True
6     True
Name: ID, dtype: bool

In [14]:
filter_d2 = data1['ID'].isin(idlist)
filter_d2

0    False
1     True
2    False
3     True
4     True
5     True
6     True
Name: ID, dtype: bool

**각 데이터프레임의 행 기준으로 'idlist' 안의 이름을 포함하고 있는 경우 True, 아닌 경우 False를 반환하는 필터(마스크)를 만든다!**

### 필터 씌우기

In [15]:
data2[filter_d2]

     ID  field1  field2  field3
1  Jane       1       1       3
3   Max       3       1       2
4  Karl       1       4       2
5   Max       3       2       2
6   Max       2       2       1

In [16]:
# 데이터 병합

pd.concat([data1[filter_d1], data2[filter_d2]])

     ID  field1  field2  field3
1  John       1       3       3
3  Karl       1       1       2
4  Karl       1       3       2
5  Karl       2       2       2
6  Andy       1       2       3
1  Jane       1       1       3
3   Max       3       1       2
4  Karl       1       4       2
5   Max       3       2       2
6   Max       2       2       1